app/Models/Modelproduct.php

	function tampildata(){
		return $this->db->table('products')->get();
---
SELECT *
FROM `products`

function simpan($save){
return $this->db->table('products')->insert($save);
---
INSERT INTO `products` (`name`, `price`, `stock`) VALUES ('Alexander Wisnuptra', '1', '1231231231')

function deletedata($stock){
	return $this->db->table('products')->delete(['stock' => $stock]);
---
DELETE FROM `products`
WHERE `stock` = '0'

function ambildata($stock){
		return $this->db->table('products')->getWhere(['stock' => $stock]);
---
SELECT *
FROM `products`
WHERE `stock` = ''